print("Задание 3.1")
print("")
print("Вводимые значения необходимо вводить числами!")

r = float(input("Введите радиус окружности: "))
print("")

pi = 3.14159
s = pi * r ** 2

print(f"Площадь окружности с Вашим радиусом равна: {s}")
print("="*60)
print("")

"-----------------------------------------------------------"

print("Задание 3.2")
print("")
print("Вводимые значение необходимо вводить числами!")
a = float(input("Введите число А: "))
b = float(input("Введите число B: "))

if a == 0:
    if b == 0:
        print("х - любое число")
    else:
        print("Нет решений. На ноль делить нельзя")
else:
    x = -b/a
    if x == 0 or x == -0:
        x = 0
    print(f"X = {x}")

print("="*60)
print("")

"-----------------------------------------------------------"

print("3.2")
print("")

print("Вводимые значения необходимо вводить числами!")
c = float(input("Введите значение температуры по Цельсия: "))

f = 9/5 * c + 32

print("Значение температуры по Фаренгейту",round(f, 2))
print("="*60)
print("")